app/Http/Controllers/ViewController.php

select `tanggal_input` from `master_data_diy` limit 1
---
    public function getcoordRadius(Request $request)
    {

        $district_within_radius = DB::select("
        SELECT
                id, name, (
                6371 * acos (
                cos ( radians($request->lat) )
                * cos( radians( lat ) )
                * cos( radians( lng ) - radians($request->lng) )
                + sin ( radians($request->lat) )
                * sin( radians( lat ) )
                )
            ) AS distance
            FROM district_locations
            HAVING distance < $request->kmrad
            ORDER BY distance
        ");


        $data = [
            "odp" =>0,
            "pdp" => 0,
            "positif" => 0,
            "populasi" => 0,
            "kecamatan" => [],
        ];
        $tanggal = MasterDataDIY::select('tanggal_input')->first();